qu1j0t3/yamaha_dac_y3014b/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_CLOCK_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_SPI_CLOCK_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_CLOCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_CLOCK_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_CLOCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE1 (number 75), J4[3]/PTE1_SPI0_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_DATAOUT_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_SPI_DATAOUT_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SPI_DATAOUT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_DATAOUT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_DATAOUT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA1 (number 61), J1[10]/PTA1_D4_T1/PTA1_IRRX
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NOTCS_DAC_1_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_1_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_1_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_NOTCS_DAC_1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_NOTCS_DAC_1_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_NOTCS_DAC_1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_NOTCS_DAC_1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTB3 (number 39), J2[8]/J2[19]/PTB3_D11_ANB2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_X_COMP_SEL_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_X_COMP_SEL_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_X_COMP_SEL_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_X_COMP_SEL_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_X_COMP_SEL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_X_COMP_SEL_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_X_COMP_SEL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTB5 (number 22), J2[6]/PTB5_D10_PWM5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Y_COMP_SEL_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Y_COMP_SEL_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Y_COMP_SEL_GPIO_PORT kGPIO_PORTB    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Y_COMP_SEL_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Y_COMP_SEL_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Y_COMP_SEL_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Y_COMP_SEL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTH0 (number 19), J2[4]/PTH0_D9_PWM0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LIMIT_LOW_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_LIMIT_LOW_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LIMIT_LOW_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_LIMIT_LOW_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LIMIT_LOW_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LIMIT_LOW_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LIMIT_LOW_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA7 (number 45), J1[16]/J2[17]/PTA7_D7_ANB1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Z_ENABLE_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Z_ENABLE_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Z_ENABLE_GPIO_PORT kGPIO_PORTA    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Z_ENABLE_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Z_ENABLE_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Z_ENABLE_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Z_ENABLE_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

